admin/app/Models/Dbs.php

SELECT *
FROM `pages`
WHERE `page` = 'solutions-screening'
ORDER BY `section_number` ASC, `type` ASC, `id` ASC
---
    public function getpageData($values="")
    {
        $builder = $this->db->table('pages');
        $builder->orderBy('section_number', 'ASC');
        $builder->orderBy('type', 'ASC');
        $builder->orderBy('id', 'ASC');
        return $builder->getWhere(['page' => $values])->getResultArray();