admin/app/Models/Event_model.php

    public function get_all() {
        return $this->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `event`
ORDER BY `id` DESC