admin/app/Models/Faq_model.php

SELECT *
FROM `faqs`
---
    public function get_all() {

        return $this->findAll();