admin/app/Models/Meta_tags_model.php

    public function get_all()
    {
        return $this->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `metatag`
ORDER BY `id` DESC