admin/app/Models/Publication_model.php

    public function get_all() {
        return $this->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `publications`
ORDER BY `id` DESC