admin/app/Controllers/Dashboard.php

SELECT *
FROM `pages`
WHERE `page` = 'HomePage'
ORDER BY `section_number` ASC, `type` ASC, `id` ASC
---
    public function homepage(){
        $builder = $this->db->table('pages');
        $builder->orderBy('section_number', 'ASC');
        $builder->orderBy('type', 'ASC');
        $builder->orderBy('id', 'ASC');
        $data['pages'] = $builder->getWhere(['page' => 'HomePage'])->getResultArray();